### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

In [3]:
df.head(10)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
5,5,Yalae81,22,Male,81,Dreamkiss,3.61
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67
8,8,Undjask33,22,Male,21,Souleater,1.10
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58

## Player Count

* Display the total number of players

In [4]:
player_details = df.loc[:,["SN","Age","Gender"]]
player_details

                SN  Age  Gender
0          Lisim78   20    Male
1      Lisovynya38   40    Male
2       Ithergue48   24    Male
3    Chamassasya86   24    Male
4        Iskosia90   23    Male
..             ...  ...     ...
775     Aethedru70   21  Female
776         Iral74   21    Male
777     Yathecal72   20    Male
778        Sisur91    7    Male
779      Ennrian78   24    Male

[780 rows x 3 columns]

In [5]:
player_details = player_details.drop_duplicates()
player_details

                SN  Age  Gender
0          Lisim78   20    Male
1      Lisovynya38   40    Male
2       Ithergue48   24    Male
3    Chamassasya86   24    Male
4        Iskosia90   23    Male
..             ...  ...     ...
773         Hala31   21    Male
774     Jiskjask80   11    Male
775     Aethedru70   21  Female
777     Yathecal72   20    Male
778        Sisur91    7    Male

[576 rows x 3 columns]

In [7]:
num_players = player_details.count()[0]
num_players

576

In [8]:
pd.DataFrame({"Total Players":[num_players]})

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [9]:
unique_item_count = len(df['Item ID'].unique())
unique_item_count

179

In [10]:
average_price = df['Price'].mean()
average_price

3.050987179487176

In [11]:
number_of_purchases = len(df['Price'])
number_of_purchases

780

In [50]:
total_revenue = df['Price'].sum()
total_revenue

2379.77

In [51]:
summary_table = pd.DataFrame({"Number of Unique Items":[unique_item_count],
                           "Average Price":[average_price],
                           "Number of Purchases":[number_of_purchases],
                           "Total Revenue":[total_revenue]})
summary_table = summary_table[["Number of Unique Items","Average Price","Number of Purchases","Total Revenue"]]
summary_table = summary_table.round(2)

summary_table.head()

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179           3.05                  780        2379.77

In [52]:
summary_table['Average Price'] = "$" + summary_table['Average Price'].astype(str)
summary_table['Total Revenue'] = "$" + summary_table['Total Revenue'].astype(str)
summary_table.head()

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [14]:
gender_count = player_details['Gender'].value_counts()
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [15]:
gender_percent = gender_count / num_players * 100
gender_percent

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [16]:
gender_demographics = pd.DataFrame({"Total Count":gender_count, "Percentage of Players":gender_percent})

gender_demographics = gender_demographics.round(2)
gender_demographics.head()

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [49]:
gender_demographics['Percentage of Players'] = gender_demographics['Percentage of Players'].astype(str) + "%"
gender_demographics.head()

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [17]:
purchase_count = df.groupby(["Gender"]).count()["Price"]
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [18]:
purchase_avg_price = df.groupby(["Gender"]).mean()["Price"]
purchase_avg_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [19]:
total_purchase_value = df.groupby(["Gender"]).sum()["Price"]
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [20]:
avg_total_purchase_per_person = total_purchase_value / gender_count
avg_total_purchase_per_person

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [22]:
summary_purchasing_analysis = pd.DataFrame({"Purchase Count":purchase_count,
                                         "Average Purchase Price":purchase_avg_price,
                                         "Total Purchase Value": total_purchase_value,
                                         "Avg Total Purchase Per Person":avg_total_purchase_per_person})

summary_purchasing_analysis = summary_purchasing_analysis[["Purchase Count","Average Purchase Price","Total Purchase Value","Avg Total Purchase Per Person"]]

summary_purchasing_analysis = summary_purchasing_analysis.round(2)
summary_purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [48]:
summary_purchasing_analysis['Average Purchase Price'] = "$" + summary_purchasing_analysis['Average Purchase Price'].astype(str)
summary_purchasing_analysis['Total Purchase Value'] = "$" + summary_purchasing_analysis['Total Purchase Value'].astype(str)
summary_purchasing_analysis['Avg Total Purchase Per Person'] = "$" + summary_purchasing_analysis['Avg Total Purchase Per Person'].astype(str)
summary_purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
Female,113,$$3.2,$361.94,$4.47
Male,652,$$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [34]:
bins = [0,9,14,19,24,29,34,39,150]
group_names = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']

unique_players = player_details.loc[:,["SN","Age"]]
unique_players

                SN  Age
0          Lisim78   20
1      Lisovynya38   40
2       Ithergue48   24
3    Chamassasya86   24
4        Iskosia90   23
..             ...  ...
773         Hala31   21
774     Jiskjask80   11
775     Aethedru70   21
777     Yathecal72   20
778        Sisur91    7

[576 rows x 2 columns]

In [35]:
unique_players["Age Ranges"] = pd.cut(unique_players["Age"], bins, labels = group_names)
unique_players

                SN  Age Age Ranges
0          Lisim78   20      20-24
1      Lisovynya38   40        40+
2       Ithergue48   24      20-24
3    Chamassasya86   24      20-24
4        Iskosia90   23      20-24
..             ...  ...        ...
773         Hala31   21      20-24
774     Jiskjask80   11      10-14
775     Aethedru70   21      20-24
777     Yathecal72   20      20-24
778        Sisur91    7        <10

[576 rows x 3 columns]

In [36]:
age_demographics_totals = unique_players['Age Ranges'].value_counts()
age_demographics_totals

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Ranges, dtype: int64

In [41]:
age_demographics_percents = (age_demographics_totals / num_players * 100).round(2)
age_demographics_percents

20-24    44.79
15-19    18.58
25-29    13.37
30-34     9.03
35-39     5.38
10-14     3.82
<10       2.95
40+       2.08
Name: Age Ranges, dtype: float64

In [45]:
age_demographics = pd.DataFrame({"Age Group Total": age_demographics_totals, "Percentage of Total": age_demographics_percents})

age_demographics.sort_index()

       Age Group Total  Percentage of Total
<10                 17                 2.95
10-14               22                 3.82
15-19              107                18.58
20-24              258                44.79
25-29               77                13.37
30-34               52                 9.03
35-39               31                 5.38
40+                 12                 2.08

In [46]:
age_demographics['Percentage of Total'] = age_demographics['Percentage of Total'].astype(str) + "%"
age_demographics.sort_index()

       Age Group Total Percentage of Total
<10                 17               2.95%
10-14               22               3.82%
15-19              107              18.58%
20-24              258              44.79%
25-29               77              13.37%
30-34               52               9.03%
35-39               31               5.38%
40+                 12               2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [54]:
bins = [0,9,14,19,24,29,34,39,150]
group_names = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']

df["Age Ranges"] = pd.cut(df["Age"], bins, labels = group_names)
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Count,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24,20-24
...,...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24,20-24

In [56]:
purchase_df = df[["SN","Price","Age Ranges"]]
purchase_df

                SN  Price Age Ranges
0          Lisim78   3.53      20-24
1      Lisovynya38   1.56        40+
2       Ithergue48   4.88      20-24
3    Chamassasya86   3.27      20-24
4        Iskosia90   1.44      20-24
..             ...    ...        ...
775     Aethedru70   3.54      20-24
776         Iral74   1.63      20-24
777     Yathecal72   3.46      20-24
778        Sisur91   4.19        <10
779      Ennrian78   4.60      20-24

[780 rows x 3 columns]

In [59]:
purchase_df_groupby = purchase_df.groupby('Age Ranges')
purchase_df_groupby

In [60]:
purchase_count = purchase_df_groupby['Price'].count()
purchase_count

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [61]:
average_prices = round(purchase_df_groupby['Price'].mean(),2)
average_prices

Age Ranges
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [62]:
total_value = round(purchase_df_groupby['Price'].sum(), 2)
total_value

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [63]:
avg_total_purchase_per_person = round(total_value / age_demographics_totals,2)
avg_total_purchase_per_person

<10      4.54
10-14    3.76
15-19    3.86
20-24    4.32
25-29    3.81
30-34    4.12
35-39    4.76
40+      3.19
dtype: float64

In [64]:
summary_purchasing_age = pd.DataFrame({"Purchase Count": purchase_count, "Average Purchase Price": average_prices, 
                                      "Total Purchase Value": total_value, "Avg Total Purchase per Person": avg_total_purchase_per_person
                                      })
summary_purchasing_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

In [65]:
summary_purchasing_age['Average Purchase Price'] = "$" + summary_purchasing_age['Average Purchase Price'].astype(str)
summary_purchasing_age['Total Purchase Value'] = "$" + summary_purchasing_age['Total Purchase Value'].astype(str)
summary_purchasing_age['Avg Total Purchase per Person'] = "$" + summary_purchasing_age['Avg Total Purchase per Person'].astype(str)
summary_purchasing_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.9,$293.0,$3.81
30-34,73,$2.93,$214.0,$4.12
35-39,41,$3.6,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [93]:
spenders_df = df.groupby('SN')
spenders_df

In [94]:
purchase_counts = spenders_df['Gender'].count()
purchase_counts

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Gender, Length: 576, dtype: int64

In [95]:
average_price = round(spenders_df['Price'].mean(),2)
average_price

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       2.07
Yathedeu43       3.01
Yoishirrala98    4.58
Zhisrisu83       3.94
Zontibe81        2.68
Name: Price, Length: 576, dtype: float64

In [96]:
total_purchase = round(spenders_df['Price'].sum(),2)
total_purchase

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [97]:
summary_top_spenders = pd.DataFrame({"Purchase Count": purchase_counts, "Average Purchase Price": average_price, 
                                      "Total Purchase Value": total_purchase})
summary_top_spenders

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                    2.28                  2.28
Adastirin33                 1                    4.48                  4.48
Aeda94                      1                    4.91                  4.91
Aela59                      1                    4.32                  4.32
Aelaria33                   1                    1.79                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                    2.07                  6.22
Yathedeu43                  2                    3.01                  6.02
Yoishirrala98               1                    4.58                  4.58
Zhisrisu83                  2                    3.94                  7.89
Zontibe81                   3                    2.68                  8.03

[576 rows x 3 columns]

In [98]:
summary_top_spenders.sort_values("Total Purchase Value",ascending=False).round(2).head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [101]:
popular_df = df.groupby(['Item ID', 'Item Name'])
popular_df

In [103]:
purchase_popular_counts = popular_df['Gender'].count()
purchase_popular_counts

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Gender, Length: 179, dtype: int64

In [106]:
item_p = round(popular_df['Price'].mean(),2)
item_price = "$" + item_p.astype(str) 
item_price

Item ID  Item Name
0        Splinter                                        $1.28
1        Crucifer                                        $2.94
2        Verdict                                         $2.48
3        Phantomlight                                    $2.49
4        Bloodlord's Fetish                               $1.7
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    $4.23
179      Wolf, Promise of the Moonwalker                 $4.48
181      Reaper's Toll                                   $1.66
182      Toothpick                                       $4.03
183      Dragon's Greatsword                             $1.09
Name: Price, Length: 179, dtype: object

In [107]:
total_p = round(popular_df['Price'].sum(),2)
total_purchase_value = "$" + total_p.astype(str)
total_purchase_value

Item ID  Item Name
0        Splinter                                         $5.12
1        Crucifer                                        $11.77
2        Verdict                                         $14.88
3        Phantomlight                                    $14.94
4        Bloodlord's Fetish                                $8.5
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    $50.76
179      Wolf, Promise of the Moonwalker                 $26.88
181      Reaper's Toll                                     $8.3
182      Toothpick                                       $12.09
183      Dragon's Greatsword                              $3.27
Name: Price, Length: 179, dtype: object

In [108]:
summary_most_populer_items = pd.DataFrame({"Purchase Count": purchase_popular_counts, "Item Price": item_price, 
                                      "Total Purchase Value": total_purchase_value})
summary_most_populer_items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,$1.28,$5.12
1,Crucifer,4,$2.94,$11.77
2,Verdict,6,$2.48,$14.88
3,Phantomlight,6,$2.49,$14.94
4,Bloodlord's Fetish,5,$1.7,$8.5
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
179,"Wolf, Promise of the Moonwalker",6,$4.48,$26.88
181,Reaper's Toll,5,$1.66,$8.3
182,Toothpick,3,$4.03,$12.09
183,Dragon's Greatsword,3,$1.09,$3.27

In [109]:
summary_most_populer_items.sort_values('Purchase Count', ascending=False).round(2).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [122]:
summary_most_populer_items.sort_values('Total Purchase Value', ascending=False).round(2).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
63,Stormfury Mace,2,$4.99,$9.98
29,"Chaos, Ender of the End",5,$1.98,$9.9
173,Stormfury Longsword,2,$4.93,$9.86
38,"The Void, Vengeance of Dark Magic",4,$2.37,$9.48
143,Frenzied Scimitar,6,$1.56,$9.36